src/cf/InformationRegisters/Share.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Share</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВариантУдаления</Name>
					<Comment>0 - не удалять, 1 - Удалить после получения, 2 - удалить в указанную дату</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/HTTPServices/ShareHTTP/Ext/Module.bsl
Функция Share_GET(Запрос)
	Ответ=Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");

	ID=Запрос.ПараметрыURL.Получить("ID");
	Если ID=Неопределено Тогда
		Ответ.КодСостояния=201;
		Ответ.УстановитьТелоИзСтроки("В параметрах запроса отсутствует строка ID!");
		Возврат Ответ;
	КонецЕсли;

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.Текст="
	|ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Share КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.ID = &ID
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Ответ.КодСостояния=202;
		Ответ.УстановитьТелоИзСтроки("Ссылка больше не активна!");
		Возврат Ответ;		
	КонецЕсли;
	стрТип=СокрЛП(Выборка.Тип);

	Если Лев(стрТип, 3)="XLS" Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/vnd.ms-excel");
	ИначеЕсли стрТип="PDF" Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/pdf");
	КонецЕсли;
	Ответ.Заголовки.Вставить("Accept-Encoding", "gzip");

	Ответ.УстановитьТелоИзДвоичныхДанных(Выборка.Данные.Получить());

	Если Выборка.ВариантУдаления=1 Тогда
		МенеджерЗаписи=РегистрыСведений.Share.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID=ID;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи.Удалить();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;

	Возврат Ответ;
КонецФункции
